wiki/shell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Shell Cookies</title>
<!-- 2015-12-28 Mon 11:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="冰糖火箭筒(Junjia Ni)" />
<meta  name="description" content="记住一些命令"
 />
<meta  name="keywords" content="shell,emacs,etags" />
<link rel="stylesheet" type="text/css" href="/static/style.css"><link rel="stylesheet" type="text/css" href="/static/medium-fonts.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="http://creamidea.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Shell Cookies</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 前言</a></li>
<li><a href="#sec-2">2. grep</a></li>
<li><a href="#sec-3">3. Emacs</a>
<ul>
<li><a href="#sec-3-1">3.1. 插入当前时间</a></li>
</ul>
</li>
<li><a href="#sec-4">4. etags &amp; ctags</a></li>
<li><a href="#sec-5">5. 尾声</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
一些常用的命令，包括使用Emacs的小技巧。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> grep</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">grep -rnw <span style="color: #2aa198;">'/path/to/somewhere/'</span> -e <span style="color: #2aa198;">"pattern"</span>
</pre>
</div>
<p>
Reference: <a href="http://stackoverflow.com/a/16957078/1925954">http://stackoverflow.com/a/16957078/1925954</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Emacs</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 插入当前时间</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">C-u M-! date
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> etags &amp; ctags</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #859900;">cd</span> /path/to/my/project
ctags -e -R *.cpp *.hpp *.h

<span style="color: #859900;">cd</span> /path/to/my/project
find . | grep <span style="color: #2aa198;">".*\.\(hh\|hxx\|cc\)"</span> | xargs etags -f TAGS

<span style="color: #859900;">cd</span> /path/to/my/project
find . -type f -iname <span style="color: #2aa198;">"*.[ch]"</span> | etags -
</pre>
</div>
<p>
常用热键
</p>
<pre class="example">
`M-.’ (‘find-tag’) – find a tag, that is, use the Tags file to look up a definition. If there are multiple tags in the project with the same name
`C-u M-.’ to go to the next match.
‘M-x find-tag-other-window’ – selects the buffer containing the tag’s definition in another window, and move point there.
‘M-*’ (‘pop-tag-mark’) – jump back
‘M-x tags-search’ – regexp-search through the source files indexed by a tags file (a bit like ‘grep’)
‘M-x tags-query-replace’ – query-replace through the source files indexed by a tags file
`M-,’ (‘tags-loop-continue’) – resume  ‘tags-search’ or ‘tags-query-replace’ starting at point in a source file
‘M-x tags-apropos’ – list all tags in a tags file that match a regexp
‘M-x list-tags’ – list all tags defined in a source file
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 尾声</h2>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">冰糖火箭筒(Junjia Ni)</p>
<p class="email"><a href="mailto:creamidea@gmail.com">creamidea@gmail.com</a></p>
<p class="date">2015-12-27</p>
<p class="export-date">2015-12-28 Mon 11:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
<p class="last-modification-time">2015-12-27 Sun 13:48</p></div><script src="/static/app.js"></script><!-- Google Analytics --><script>window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><script async src='//www.google-analytics.com/analytics.js'></script><!-- End Google Analytics -->
</div>
</body>
</html>
